[
  {
    "slug": "full-stack-developer",
    "title": "Full-Time Full-Stack Developer – MVP Civic Tech Platform",
    "location": "Remote",
    "type": "Full-Time Contract (1 year, with potential to extend)",
    "startDate": "August 22, 2025",
    "deadline": "11:59 PM WAT, August 4, 2025",
    "company": "Nexus Engineering & Planning Ltd.",
    "website": "https://www.nexuseng.org",
    "summary": "We're hiring a full-time developer to build a new civic-tech platform from scratch. You'll work independently, shape product direction, and implement full-stack features using modern tools and open data principles.",
    "whyItMatters": "Nexus is building a civic-tech platform to make verified public data accessible in real time—helping users engage with accurate, trustworthy information when it matters most. We're laying the foundation for a suite of open-access dashboards spanning governance, housing, transit, health, and more—all built on a unified architecture designed for long-term public value.",
    "responsibilities": "Own full-stack development including architecture, backend APIs, frontend interfaces, authentication, mapping, and deployment. Collaborate with designers and provide feedback to help shape the product vision.",
    "stack": {
      "frontend": ["React", "Next.js", "TypeScript", "Tailwind CSS"],
      "backend": ["Node.js", "Express", "GraphQL"],
      "database": ["DynamoDB", "PostgreSQL"],
      "hosting": ["AWS Amplify", "Netlify", "S3 + CloudFront"],
      "mapping": ["Mapbox GL JS", "Leaflet"],
      "auth": ["AWS Cognito", "Firebase Auth"],
      "versioning": ["GitHub"]
    },
    "requirements": [
      "3+ years of full-stack development experience",
      "Strong proficiency in React and TypeScript",
      "Experience building and consuming REST or GraphQL APIs",
      "Ability to deploy and maintain scalable, secure backend services",
      "Self-directed with excellent communication skills"
    ],
    "bonuses": [
      "Experience with civic tech, geospatial data, or election-related tools",
      "Familiarity with Nigeria’s electoral/polling unit landscape",
      "Experience working with open data or digital transparency platforms"
    ],
    "howToApply": "Please submit your application via the form. You'll be asked to share a brief introduction, links to relevant past work (GitHub, portfolio, etc.), your availability, and expected monthly salary in NGN. Applications will be reviewed on a rolling basis until the position is filled. We aim to onboard by mid-August.",
    "applicationLink": "https://forms.gle/bfS3LFotXLXfb84i6",
    "terms": [
      "Full-time",
      "1-year initial contract with 3-month probation",
      "Fully remote",
      "All IP retained by Nexus Engineering & Planning Ltd."
    ]
  },

  {
  "slug": "technical-data-analyst",
  "title": "Full-Time Technical Data Analyst",
  "location": "Remote",
  "type": "Full-Time Contract (1 year, with potential to extend)",
  "startDate": "August 26, 2025",
  "deadline": "11:59 PM WAT, August 4, 2025",
  "company": "Nexus Engineering & Planning Ltd.",
  "website": "https://www.nexuseng.org",
  "summary": "We’re hiring a full-time technical data analyst to support the development of data-driven dashboards and public insights. You’ll work across civic and spatial datasets, build clean pipelines, and collaborate with the project team to extract insights that inform visual storytelling and reporting.",
  "whyItMatters": "At Nexus, we use data to improve public understanding of infrastructure, governance, and planning. Your work will help transform raw datasets into clear insights that support transparency, civic engagement, and better decision-making.",
  "responsibilities": "Work with structured and spatial datasets to support dashboards and reporting. Develop repeatable data workflows and assist in QA. Collaborate with developers and the project manager to identify key insights for internal and external communications.",
  "stack": {
    "languages": ["Python","SQL"],
    "tools": ["R","Pandas", "GeoPandas", "BigQuery", "Power BI", "QGIS"],
    "data": ["GeoJSON", "Shapefiles", "CSV", "REST APIs"],
    "versioning": ["GitHub"]
  },
  "requirements": [
    "2+ years of experience in data analysis or spatial analytics",
    "Proficiency in Python or R",
    "Experience working with public or civic datasets",
    "Strong attention to detail and documentation",
    "Effective communication and teamwork"
  ],
  "bonuses": [
    "Familiarity with Nigerian public data or election datasets",
    "Experience supporting blog posts or newsletters with insights",
    "Experience with dashboard platforms or data visualization tools"
  ],
  "howToApply": "Apply via the form. Please include a brief introduction, links to past work (dashboards, repositories, or reports), your availability, and expected monthly rate. Applications will be reviewed on a rolling basis until the position is filled.",
  "applicationLink": "https://forms.gle/FiRJWuAM9rH58rgb6",
  "terms": [
    "Full-time",
    "1-year contract with 3-month probation",
    "Remote",
    "All IP retained by Nexus Engineering & Planning Ltd."
  ]
}
 
]
